"""

Home Work 2 Task 5 (домашнее задание без звездочки - обязательно для выполнения)
Vitaliy Dubinin

"""

costs = [54.82, 22.5, 31.58, 10, 32, 31.17, 49.5, 1252, 11.11, 10500.51, 2, 79.16, 18.5, 150, 12.17, 255]

print('Список цен в рублях и копейках:','\n')
for cost in costs:
    r = int(cost)
    kk = (cost - r) * 100
    print(f'{r} руб {kk:02.0f} коп', '\n')

costs = [54.82, 22.5, 31.58, 10, 32, 31.17, 49.5, 1252, 11.11, 10500.51, 2, 79.16, 18.5, 150, 12.17, 255]
print(id(costs), 'id cписка до сортировки', '\n')
costs.sort()
print(id(costs), 'id cписка после сортировки', '\n')
print('Сортированный список цен по возрастанию: ','\n')
for cost in costs:
    r = int(cost)
    kk = (cost - int(cost)) * 100
    print(f'{r} руб {kk:02.0f} коп', '\n')
print()

a = costs[::-1]
print('Список цен на товары по убыванию :',a, '\n' )
print()

costs = [54.82, 22.5, 31.58, 10, 32, 31.17, 49.5, 1252, 11.11, 10500.51, 2, 79.16, 18.5, 150, 12.17, 255]
print('Список пяти самых дорогих товаров: ','\n')
for cost in sorted(costs)[::-1][:5]:
    r = int(cost)
    kk = (cost - int(cost)) * 100
    print(f'{r} руб {kk:02.0f} коп','\n')

